# DocumentId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentClosedEventArgs..::..DocumentId Property
DocumentClosedEventArgs Class See Also
---
Id of the document that has just been closed.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public int DocumentId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DocumentId As Integer
	Get
```

Visual C++
---
```text
public:
property int DocumentId {
	int get ();
}
```

# Remarks
This Id is only used to identify the document for the duration of this event and the DocumentClosing event which preceded it. It serves as synchronization means for the pair of events.
# See Also
DocumentClosedEventArgs Class
Autodesk.Revit.DB.Events Namespace